#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

[command]/home/runner/work/_temp/3f8da5f1-f023-43a2-8a7a-0071eac51c2f/terraform-bin plan -no-color
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Cataprato/cataprato-workspace/runs/run-3AXagK2pEtAk2ojk

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.lambda_function.data.external.archive_prepare[0]: Refreshing...
module.lambda_layer_s3.data.external.archive_prepare[0]: Refreshing...
module.lambda_function.data.external.archive_prepare[0]: Refresh complete after 0s [id=-]
module.lambda_layer_s3.data.external.archive_prepare[0]: Refresh complete after 0s [id=-]
data.aws_caller_identity.current: Refreshing...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.lambda_function.data.aws_region.current: Refreshing...
module.lambda_layer_s3.data.aws_region.current: Refreshing...
module.lambda_function.data.aws_partition.current: Refreshing...
module.lambda_layer_s3.data.aws_caller_identity.current: Refreshing...
module.lambda.aws_lambda_function.this: Refreshing state... [id=lambda_function_name]
module.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_partition.current: Refreshing...
module.lambda_layer_s3.data.aws_region.current: Refresh complete after 0s [id=us-east-1]
module.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.s3_bucket.data.aws_caller_identity.current: Refreshing...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=2690255455]
module.lambda_layer_s3.data.aws_partition.current: Refreshing...
module.s3_bucket.data.aws_canonical_user_id.this: Refreshing...
module.lambda_function.data.aws_caller_identity.current: Refreshing...
module.s3_bucket.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.lambda_layer_s3.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_organizations_organization.this: Refreshing...
module.s3_bucket.data.aws_region.current: Refreshing...
module.s3_bucket.data.aws_region.current: Refresh complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]
data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]
module.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]
module.s3_bucket.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]
module.s3_bucket.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c20555c7d3c8cb7cec2fd9dacdea0f908ba112c4d5934db79995f4ddc3c36ede]
data.aws_organizations_organization.this: Refresh complete after 0s [id=o-w0iv42zpgi]
module.lambda.aws_lambda_function.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.lambda.aws_lambda_function.this will be destroyed
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name" -> null
      - filename                       = "dist.zip" -> null
      - function_name                  = "lambda_function_name" -> null
      - handler                        = "dist/lambda" -> null
      - id                             = "lambda_function_name" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name/invocations" -> null
      - last_modified                  = "2023-08-01T23:54:01.608+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> null
      - runtime                        = "nodejs18.x" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "z62MskzEmjQL5by6KnALmCUBjKmLlhoNG718aWGySk4=" -> null
      - source_code_size               = 2125 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cataprato-core-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "cataprato-core-lambda-logs"
      + name_prefix = (known after apply)
      + path        = "/tf-managed/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cataprato-core-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/tf-managed/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cataprato-core-lambda"
    }

  # module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "Cataprato core"
      + function_name                  = "cataprato-core-lambda"
      + handler                        = "lambda.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {
          + create = "20m"
          + delete = "20m"
          + update = "20m"
        }
    }

  # module.lambda_function.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "AWS_IAM"
      + function_arn       = (known after apply)
      + function_name      = "cataprato-core-lambda"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "RESPONSE_STREAM"
      + url_id             = (known after apply)

      + cors {
          + allow_credentials = true
          + allow_headers     = [
              + "date",
              + "keep-alive",
            ]
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + expose_headers    = [
              + "date",
              + "keep-alive",
            ]
          + max_age           = 86400
        }
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cataprato-core-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
      + statement_id        = "APIGatewayAny"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cataprato-core-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
      + statement_id        = "APIGatewayAny"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda-builds/"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./dist/lambda.js",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
              + runtime       = "nodejs18.x"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
          + "timestamp" = "1691192146257853000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
          + "original_source_code" = "\"./dist/lambda.js\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs18.x",
        ]
      + created_date                = (known after apply)
      + description                 = "Node_modules layer"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "cataprato-core-layer-s3"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./dist",
                      + null,
                    ],
                ]
              + filename      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
          + "timestamp" = "1691192146278677000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
          + "original_source_code" = "\"./dist\""
          + "resource_name"        = "aws_lambda_layer_version.this[0]"
          + "resource_type"        = "LAMBDA_LAYER"
          + "source_code_property" = "path"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 21 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 6 estimated
           $0.0/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/Cataprato/cataprato-workspace/runs/run-3AXagK2pEtAk2ojk%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.5.3%0Aon linux_amd64%0AInitializing plugins and modules...%0Amodule.lambda_function.data.external.archive_prepare[0]: Refreshing...%0Amodule.lambda_layer_s3.data.external.archive_prepare[0]: Refreshing...%0Amodule.lambda_function.data.external.archive_prepare[0]: Refresh complete after 0s [id=-]%0Amodule.lambda_layer_s3.data.external.archive_prepare[0]: Refresh complete after 0s [id=-]%0Adata.aws_caller_identity.current: Refreshing...%0Amodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...%0Amodule.lambda_function.data.aws_region.current: Refreshing...%0Amodule.lambda_layer_s3.data.aws_region.current: Refreshing...%0Amodule.lambda_function.data.aws_partition.current: Refreshing...%0Amodule.lambda_layer_s3.data.aws_caller_identity.current: Refreshing...%0Amodule.lambda.aws_lambda_function.this: Refreshing state... [id=lambda_function_name]%0Amodule.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-east-1]%0Amodule.s3_bucket.data.aws_partition.current: Refreshing...%0Amodule.lambda_layer_s3.data.aws_region.current: Refresh complete after 0s [id=us-east-1]%0Amodule.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws]%0Amodule.s3_bucket.data.aws_caller_identity.current: Refreshing...%0Amodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=2690255455]%0Amodule.lambda_layer_s3.data.aws_partition.current: Refreshing...%0Amodule.s3_bucket.data.aws_canonical_user_id.this: Refreshing...%0Amodule.lambda_function.data.aws_caller_identity.current: Refreshing...%0Amodule.s3_bucket.data.aws_partition.current: Refresh complete after 0s [id=aws]%0Amodule.lambda_layer_s3.data.aws_partition.current: Refresh complete after 0s [id=aws]%0Adata.aws_organizations_organization.this: Refreshing...%0Amodule.s3_bucket.data.aws_region.current: Refreshing...%0Amodule.s3_bucket.data.aws_region.current: Refresh complete after 0s [id=us-east-1]%0Amodule.lambda_layer_s3.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]%0Adata.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]%0Amodule.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]%0Amodule.s3_bucket.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538]%0Amodule.s3_bucket.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c20555c7d3c8cb7cec2fd9dacdea0f908ba112c4d5934db79995f4ddc3c36ede]%0Adata.aws_organizations_organization.this: Refresh complete after 0s [id=o-w0iv42zpgi]%0Amodule.lambda.aws_lambda_function.this: Drift detected (update)%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # random_pet.this will be created%0A  + resource "random_pet" "this" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + separator = "-"%0A    }%0A%0A  # module.lambda.aws_lambda_function.this will be destroyed%0A  - resource "aws_lambda_function" "this" {%0A      - architectures                  = [%0A          - "x86_64",%0A        ] -> null%0A      - arn                            = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name" -> null%0A      - filename                       = "dist.zip" -> null%0A      - function_name                  = "lambda_function_name" -> null%0A      - handler                        = "dist/lambda" -> null%0A      - id                             = "lambda_function_name" -> null%0A      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name/invocations" -> null%0A      - last_modified                  = "2023-08-01T23:54:01.608+0000" -> null%0A      - layers                         = [] -> null%0A      - memory_size                    = 128 -> null%0A      - package_type                   = "Zip" -> null%0A      - publish                        = false -> null%0A      - qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST" -> null%0A      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST/invocations" -> null%0A      - reserved_concurrent_executions = -1 -> null%0A      - role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> null%0A      - runtime                        = "nodejs18.x" -> null%0A      - skip_destroy                   = false -> null%0A      - source_code_hash               = "z62MskzEmjQL5by6KnALmCUBjKmLlhoNG718aWGySk4=" -> null%0A      - source_code_size               = 2125 -> null%0A      - tags                           = {} -> null%0A      - tags_all                       = {} -> null%0A      - timeout                        = 3 -> null%0A      - version                        = "$LATEST" -> null%0A%0A      - ephemeral_storage {%0A          - size = 512 -> null%0A        }%0A%0A      - tracing_config {%0A          - mode = "PassThrough" -> null%0A        }%0A    }%0A%0A  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply%0A <= data "aws_iam_policy_document" "logs" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "logs:CreateLogGroup",%0A              + "logs:CreateLogStream",%0A              + "logs:PutLogEvents",%0A            ]%0A          + effect    = "Allow"%0A          + resources = (known after apply)%0A        }%0A    }%0A%0A  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created%0A  + resource "aws_cloudwatch_log_group" "lambda" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/aws/lambda/cataprato-core-lambda"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 0%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # module.lambda_function.aws_iam_policy.logs[0] will be created%0A  + resource "aws_iam_policy" "logs" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "cataprato-core-lambda-logs"%0A      + name_prefix = (known after apply)%0A      + path        = "/tf-managed/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.lambda_function.aws_iam_role.lambda[0] will be created%0A  + resource "aws_iam_role" "lambda" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = true%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cataprato-core-lambda"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/tf-managed/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "logs" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "cataprato-core-lambda"%0A    }%0A%0A  # module.lambda_function.aws_lambda_function.this[0] will be created%0A  + resource "aws_lambda_function" "this" {%0A      + architectures                  = [%0A          + "x86_64",%0A        ]%0A      + arn                            = (known after apply)%0A      + description                    = "Cataprato core"%0A      + function_name                  = "cataprato-core-lambda"%0A      + handler                        = "lambda.handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + layers                         = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = true%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "nodejs18.x"%0A      + s3_bucket                      = (known after apply)%0A      + s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      + s3_object_version              = (known after apply)%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = (known after apply)%0A      + source_code_size               = (known after apply)%0A      + tags_all                       = (known after apply)%0A      + timeout                        = 3%0A      + version                        = (known after apply)%0A%0A      + ephemeral_storage {%0A          + size = 512%0A        }%0A%0A      + timeouts {%0A          + create = "20m"%0A          + delete = "20m"%0A          + update = "20m"%0A        }%0A    }%0A%0A  # module.lambda_function.aws_lambda_function_url.this[0] will be created%0A  + resource "aws_lambda_function_url" "this" {%0A      + authorization_type = "AWS_IAM"%0A      + function_arn       = (known after apply)%0A      + function_name      = "cataprato-core-lambda"%0A      + function_url       = (known after apply)%0A      + id                 = (known after apply)%0A      + invoke_mode        = "RESPONSE_STREAM"%0A      + url_id             = (known after apply)%0A%0A      + cors {%0A          + allow_credentials = true%0A          + allow_headers     = [%0A              + "date",%0A              + "keep-alive",%0A            ]%0A          + allow_methods     = [%0A              + "*",%0A            ]%0A          + allow_origins     = [%0A              + "*",%0A            ]%0A          + expose_headers    = [%0A              + "date",%0A              + "keep-alive",%0A            ]%0A          + max_age           = 86400%0A        }%0A    }%0A%0A  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created%0A  + resource "aws_lambda_permission" "current_version_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "cataprato-core-lambda"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + qualifier           = (known after apply)%0A      + source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"%0A      + statement_id        = "APIGatewayAny"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] will be created%0A  + resource "aws_lambda_permission" "unqualified_alias_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "cataprato-core-lambda"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"%0A      + statement_id        = "APIGatewayAny"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # module.lambda_function.aws_s3_object.lambda_package[0] will be created%0A  + resource "aws_s3_object" "lambda_package" {%0A      + acl                    = "private"%0A      + bucket                 = (known after apply)%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      + storage_class          = "ONEZONE_IA"%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.lambda_function.local_file.archive_plan[0] will be created%0A  + resource "local_file" "archive_plan" {%0A      + content              = jsonencode(%0A            {%0A              + artifacts_dir = "./.terraform/lambda-builds/"%0A              + build_plan    = [%0A                  + [%0A                      + "zip",%0A                      + "./dist/lambda.js",%0A                      + null,%0A                    ],%0A                ]%0A              + filename      = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A              + runtime       = "nodejs18.x"%0A            }%0A        )%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0755"%0A      + file_permission      = "0644"%0A      + filename             = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.plan.json"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.lambda_function.null_resource.archive[0] will be created%0A  + resource "null_resource" "archive" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A          + "timestamp" = "1691192146257853000"%0A        }%0A    }%0A%0A  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created%0A  + resource "null_resource" "sam_metadata_aws_lambda_function" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A          + "original_source_code" = "\"./dist/lambda.js\""%0A          + "resource_name"        = "aws_lambda_function.this[0]"%0A          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"%0A          + "source_code_property" = "path"%0A        }%0A    }%0A%0A  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created%0A  + resource "aws_lambda_layer_version" "this" {%0A      + arn                         = (known after apply)%0A      + compatible_runtimes         = [%0A          + "nodejs18.x",%0A        ]%0A      + created_date                = (known after apply)%0A      + description                 = "Node_modules layer"%0A      + id                          = (known after apply)%0A      + layer_arn                   = (known after apply)%0A      + layer_name                  = "cataprato-core-layer-s3"%0A      + s3_bucket                   = (known after apply)%0A      + s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      + s3_object_version           = (known after apply)%0A      + signing_job_arn             = (known after apply)%0A      + signing_profile_version_arn = (known after apply)%0A      + skip_destroy                = false%0A      + source_code_hash            = (known after apply)%0A      + source_code_size            = (known after apply)%0A      + version                     = (known after apply)%0A    }%0A%0A  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created%0A  + resource "aws_s3_object" "lambda_package" {%0A      + acl                    = "private"%0A      + bucket                 = (known after apply)%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      + storage_class          = "ONEZONE_IA"%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.lambda_layer_s3.local_file.archive_plan[0] will be created%0A  + resource "local_file" "archive_plan" {%0A      + content              = jsonencode(%0A            {%0A              + artifacts_dir = "builds"%0A              + build_plan    = [%0A                  + [%0A                      + "zip",%0A                      + "./dist",%0A                      + null,%0A                    ],%0A                ]%0A              + filename      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A              + runtime       = ""%0A            }%0A        )%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0755"%0A      + file_permission      = "0644"%0A      + filename             = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.plan.json"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.lambda_layer_s3.null_resource.archive[0] will be created%0A  + resource "null_resource" "archive" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A          + "timestamp" = "1691192146278677000"%0A        }%0A    }%0A%0A  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] will be created%0A  + resource "null_resource" "sam_metadata_aws_lambda_layer_version" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A          + "original_source_code" = "\"./dist\""%0A          + "resource_name"        = "aws_lambda_layer_version.this[0]"%0A          + "resource_type"        = "LAMBDA_LAYER"%0A          + "source_code_property" = "path"%0A        }%0A    }%0A%0A  # module.s3_bucket.aws_s3_bucket.this[0] will be created%0A  + resource "aws_s3_bucket" "this" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = false%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "this" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created%0A  + resource "aws_s3_bucket_versioning" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 21 to add, 0 to change, 1 to destroy.%0A%0A------------------------------------------------------------------------%0A%0ACost Estimation:%0A%0AResources: 0 of 6 estimated%0A           $0.0/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>
*Pushed by: @filipezz, Action: `pull_request`*